---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.BreakCornerCondition.AnglesGreaterThan
enum: Autodesk.Revit.DB.Architecture.BreakCornerCondition
source: html/ee5a1e5e-436d-1d4d-d9ae-9569d90c231a.htm
---
# Autodesk.Revit.DB.Architecture.BreakCornerCondition.AnglesGreaterThan

Corner posts are inserted only when the angle between neighboring path segments is greater than the defined.